#딕셔너리(사전)
# 얘는 순서가 없음.
# d={'q':10,'w':20,'e':30,'r':40}
# print(d['r'])

# d={'가':20,'나':30}
# print(d['가'],'살')
# 
# d={'가':[20,165.5],'나':[30,156]}
# print(d['가'][0],d['가'][1])
# 
# d={'가':{'나이':20,'키':165.5},'나':{'나이':30,'키':156}}
# print(d['가']['나이'])
# print(d['가'])
# 
# #딕셔너리에 데이터 추가
# d={}
# d['홍길동']=20
# d['순신']='키30','나이20'
# print(d)

#실습)언어 불러오기
# {'backend':'java','frontend':'html'}
# a={}
# b=input('언어는?')
# a['backend'] = b
# c=input('2번째 언어는?')
# a['frontend'] =c
# print(a)

d={1:'고질라',2:'귀멸의칼날',3:'미나리'}
print(list(d.keys()))#키만 가져옴
print(list(d.values())[1])#값만 가져옴














